#include "solution.h"
/*
< 문제 설명 >
solution 함수를 완성하세요.
solution 함수는 매개변수로 5*5 행렬 map[5][5]과 10개의 원소로 이뤄진 배열 move[10]을 받습니다.
주어진 map[5][5] 에서 자신의 위치(2)를 기준으로 주어진 move[10]대로 이동했을때 만나는 버섯(1)의 수를 return합니다.

소스코드 실행시 저장된 테스트케이스를 자동으로 solution()함수의 인자로 넣어 차례대로 테스트 합니다.

Example))

map = {
	{0,0,0,0,1},
	{0,1,0,0,0},
	{0,0,0,2,0},
	{0,1,0,0,1},
	{0,0,0,0,0}
}

move = { 'w','a','a','s','s','d','d','d','w','w'}

2차원 행렬 map에서 2는 자신의 위치, 1은 버섯의 위치 이며 0은 빈 공간이다.
1차원 행렬 move 'w','a','s','d'는 상-우-하-좌 로 이동하는 것을 의미한다.

*주어진 map에서 2의 개수는 1개, 1의 개수는 랜덤, 1,2의 위치 또한 랜덤이다.
*2의 위치는 벽을 뚫고 이동할 수 없으며, 벽을 뚫어야 하는 움직임은 무효 처리된다.
*만났던 1을 다시만나는 경우 만남횟수는 카운트되지 않는다.

*/
int solution(int map[5][5], char move[10]) {
	 // 여기에서 코드 작성을 시작하세요 !!!
	int result = 0;
	return result;
}
